examples/dfHighSpeedFoam/twoD_detC2H4WaterMist/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
        DUcDt           cellPoint;
    }

    integrationSchemes
    {
        U               Euler;
        T               Euler;
    }
}


constantProperties
{
    T0              300;

    // place holders for rho0 and Cp0
    // - reset from liquid properties using T0
    rho0            997;
    Cp0             4187;

    constantVolume  false;
}


subModels
{
    particleForces
    {
        sphereDrag;
        pressureGradient;
    }

    injectionModels
    {
        model1
        {
            type              manualInjection;
            massTotal         6.03525e-06; // total mass
            positionsFile     "cloudPositions"; 
            parcelBasisType   mass;
            duration          0;
            SOI               5.9e-05; 
            U0                (0.0 0.0 0.0);
            sizeDistribution
            {
                type uniform;
                uniformDistribution
                {
                    minValue        11e-06; 
                    maxValue        11e-06;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel none;//standardWallInteraction;

    heatTransferModel RanzMarshall;

    compositionModel singlePhaseMixture;

    phaseChangeModel liquidEvaporationBoil;

    surfaceFilmModel none;

    atomizationModel none;

    breakupModel    none;//ReitzDiwakar; // ReitzKHRT;

    stochasticCollisionModel none;

    radiation       off;

    // standardWallInteractionCoeffs
    // {
    //     type            rebound;
    // }

    RanzMarshallCoeffs
    {
        BirdCorrection  off;//true;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                H2O               1;
            }
        );
    }

    liquidEvaporationBoilCoeffs
    {
        enthalpyTransfer latentHeat;//enthalpyDifference;

        activeLiquids    ( H2O );
    }
    
}


cloudFunctions
{}


// ************************************************************************* //
