examples/dfHighSpeedFoam/twoD_detC2H4WaterMist/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices 
(
	(2  0    0)
    (5  0    0)
    (5  0.45 0)
    (2  0.45 0)
    (2  0    0.1)
    (5  0    0.1)
    (5  0.45 0.1)
    (2  0.45 0.1)
);

blocks
(
	hex (0 1 2 3 4 5 6 7) (6000 900 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type symmetryPlane;
        faces
        (
            (1 2 6 5)
        );
    }
	bottom
	{
		type cyclic;
		faces
		(
	 		(0 1 5 4) 
		);
		neighbourPatch top;
	}
	top
	{
		type cyclic;
		faces
		(
		 	(3 7 6 2)

		);
		neighbourPatch bottom;
	}
    frontAndBack
    {
        type empty;
        faces
        (
            (5 6 7 4)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
