examples/dfHighSpeedFoam/twoD_detC2H4WaterMist/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue T 300 // [K]
    volScalarFieldValue p 101325 // [Pa]
);

regions
(
    boxToCell
    {
        box (0.2 0.0025 0) (0.204 0.0125 1);
        fieldValues
        (
				volScalarFieldValue T 3000 // [K]
                volScalarFieldValue p 10132500 // 100atm
        );
    }
    boxToCell
    {
        box (0.2 0.0175 0) (0.204 0.0275 1);
        fieldValues
        (
				volScalarFieldValue T 3000 // [K]
                volScalarFieldValue p 10132500 // 100atm
        );
    }
    boxToCell
    {
        box (0.2 0.0325 0) (0.204 0.0425 1);
        fieldValues
        (
				volScalarFieldValue T 3000 // [K]
                volScalarFieldValue p 10132500 // 100atm
        );
    }
);


// ************************************************************************* //
